; domain
(define (domain emergency-logistics)
  (:requirements :strips :typing)

  (:types
    drone arm location person box content - object
  )

  (:predicates
    (at-drone ?d - drone ?l - location)
    (at-person ?p - person ?l - location)
    (at-box ?c - box ?l - location)

    (arm-of ?a - arm ?d - drone)
    (arm-free ?a - arm)
    (holding ?a - arm ?c - box)

    (box-has ?c - box ?t - content)
    (person-has ?p - person ?t - content)
  )

  (:action fly
    :parameters (?d - drone ?from - location ?to - location)
    :precondition (at-drone ?d ?from)
    :effect (and
      (at-drone ?d ?to)
      (not (at-drone ?d ?from))
    )
  )

  (:action pick
    :parameters (?d - drone ?a - arm ?c - box ?l - location)
    :precondition (and
      (arm-of ?a ?d)
      (arm-free ?a)
      (at-drone ?d ?l)
      (at-box ?c ?l)
    )
    :effect (and
      (holding ?a ?c)
      (not (arm-free ?a))
      (not (at-box ?c ?l))
    )
  )

  (:action drop
    :parameters (?d - drone ?a - arm ?c - box ?l - location)
    :precondition (and
      (arm-of ?a ?d)
      (at-drone ?d ?l)
      (holding ?a ?c)
    )
    :effect (and
      (at-box ?c ?l)
      (arm-free ?a)
      (not (holding ?a ?c))
    )
  )

  (:action deliver
    :parameters (?d - drone ?a - arm ?c - box ?p - person ?l - location ?t - content)
    :precondition (and
      (arm-of ?a ?d)
      (at-drone ?d ?l)
      (at-person ?p ?l)
      (holding ?a ?c)
      (box-has ?c ?t)
    )
    :effect (and
      (person-has ?p ?t)
      (at-box ?c ?l)
      (arm-free ?a)
      (not (holding ?a ?c))
    )
  )
)

; problem
(define (problem p2)
  (:domain emergency-logistics)

  (:objects
    d1 - drone
    a1 a2 - arm
    depot loc1 loc2 - location

    bob carol - person

    box1 box2 box3 - box

    food medicine - content
  )

  (:init
    (at-drone d1 depot)

    (arm-of a1 d1)
    (arm-of a2 d1)
    (arm-free a1)
    (arm-free a2)

    (at-person bob loc1)
    (at-person carol loc2)

    (at-box box1 depot)
    (at-box box2 depot)
    (at-box box3 depot)

    (box-has box1 food)
    (box-has box2 medicine)
    (box-has box3 food)
  )

  (:goal (and
    (person-has bob food)
    (person-has carol medicine)
  ))
)

; plan
1. (pick d1 a1 box1 depot)
   deleted: (arm-free a1) (at-box box1 depot)
   added: (holding a1 box1)
   goals met: 0 of 2
2. (pick d1 a2 box2 depot)
   deleted: (arm-free a2) (at-box box2 depot)
   added: (holding a2 box2)
   goals met: 0 of 2
3. (fly d1 depot loc1)
   deleted: (at-drone d1 depot)
   added: (at-drone d1 loc1)
   goals met: 0 of 2
4. (deliver d1 a1 box1 bob loc1 food)
   deleted: (holding a1 box1)
   added: (person-has bob food) (at-box box1 loc1) (arm-free a1)
   goals met: 1 of 2
5. (fly d1 loc1 loc2)
   deleted: (at-drone d1 loc1)
   added: (at-drone d1 loc2)
   goals met: 1 of 2
6. (deliver d1 a2 box2 carol loc2 medicine)
   deleted: (holding a2 box2)
   added: (person-has carol medicine) (at-box box2 loc2) (arm-free a2)
   goals met: 2 of 2
